---
kind: type
id: T:Autodesk.Revit.DB.ModelCurveArrArray
source: html/0db60df5-4ffd-457e-462d-f03517fa99bf.htm
---
# Autodesk.Revit.DB.ModelCurveArrArray

An array that can contain any type of object.

## Syntax (C#)
```csharp
public class ModelCurveArrArray : APIObject,
	IEnumerable
```